MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM144/mcu.h
extern volatile __IPC14bits_t IPC14bits __asm__ ("IPC14") __attribute__((section("sfrs"), address(0xBF810220)));
extern volatile uint32_t        IPC14CLR __attribute__((section("sfrs"),address(0xBF810224)));
extern volatile uint32_t        IPC14SET __attribute__((section("sfrs"),address(0xBF810228)));
extern volatile uint32_t        IPC14INV __attribute__((section("sfrs"),address(0xBF81022C)));
#define IPC15 IPC15
extern volatile uint32_t   IPC15 __attribute__((section("sfrs"), address(0xBF810230)));
typedef union {
  struct {
    uint32_t AD1D1IS:2;
    uint32_t AD1D1IP:3;
    uint32_t :3;
    uint32_t AD1D2IS:2;
    uint32_t AD1D2IP:3;
    uint32_t :3;
    uint32_t AD1D3IS:2;
    uint32_t AD1D3IP:3;
    uint32_t :3;
    uint32_t AD1D4IS:2;
    uint32_t AD1D4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC15bits_t;
extern volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs"), address(0xBF810230)));
extern volatile uint32_t        IPC15CLR __attribute__((section("sfrs"),address(0xBF810234)));
extern volatile uint32_t        IPC15SET __attribute__((section("sfrs"),address(0xBF810238)));
extern volatile uint32_t        IPC15INV __attribute__((section("sfrs"),address(0xBF81023C)));
#define IPC16 IPC16
extern volatile uint32_t   IPC16 __attribute__((section("sfrs"), address(0xBF810240)));
typedef union {
  struct {
    uint32_t AD1D5IS:2;
    uint32_t AD1D5IP:3;
    uint32_t :3;
    uint32_t AD1D6IS:2;
    uint32_t AD1D6IP:3;
    uint32_t :3;
    uint32_t AD1D7IS:2;
    uint32_t AD1D7IP:3;
    uint32_t :3;
    uint32_t AD1D8IS:2;
    uint32_t AD1D8IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC16bits_t;
extern volatile __IPC16bits_t IPC16bits __asm__ ("IPC16") __attribute__((section("sfrs"), address(0xBF810240)));
extern volatile uint32_t        IPC16CLR __attribute__((section("sfrs"),address(0xBF810244)));
extern volatile uint32_t        IPC16SET __attribute__((section("sfrs"),address(0xBF810248)));
extern volatile uint32_t        IPC16INV __attribute__((section("sfrs"),address(0xBF81024C)));
#define IPC17 IPC17
extern volatile uint32_t   IPC17 __attribute__((section("sfrs"), address(0xBF810250)));
typedef union {
  struct {
    uint32_t AD1D9IS:2;
    uint32_t AD1D9IP:3;
    uint32_t :3;
    uint32_t AD1D10IS:2;
    uint32_t AD1D10IP:3;
    uint32_t :3;
    uint32_t AD1D11IS:2;
    uint32_t AD1D11IP:3;
    uint32_t :3;
    uint32_t AD1D12IS:2;
    uint32_t AD1D12IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs"), address(0xBF810250)));
extern volatile uint32_t        IPC17CLR __attribute__((section("sfrs"),address(0xBF810254)));
extern volatile uint32_t        IPC17SET __attribute__((section("sfrs"),address(0xBF810258)));
extern volatile uint32_t        IPC17INV __attribute__((section("sfrs"),address(0xBF81025C)));
#define IPC18 IPC18
extern volatile uint32_t   IPC18 __attribute__((section("sfrs"), address(0xBF810260)));
typedef union {
  struct {
    uint32_t AD1D13IS:2;
    uint32_t AD1D13IP:3;
    uint32_t :3;
    uint32_t AD1D14IS:2;
    uint32_t AD1D14IP:3;
    uint32_t :3;
    uint32_t AD1D15IS:2;
    uint32_t AD1D15IP:3;
    uint32_t :3;
    uint32_t AD1D16IS:2;
    uint32_t AD1D16IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs"), address(0xBF810260)));
extern volatile uint32_t        IPC18CLR __attribute__((section("sfrs"),address(0xBF810264)));
extern volatile uint32_t        IPC18SET __attribute__((section("sfrs"),address(0xBF810268)));
extern volatile uint32_t        IPC18INV __attribute__((section("sfrs"),address(0xBF81026C)));
#define IPC19 IPC19
extern volatile uint32_t   IPC19 __attribute__((section("sfrs"), address(0xBF810270)));
typedef union {
  struct {
    uint32_t AD1D17IS:2;
    uint32_t AD1D17IP:3;
    uint32_t :3;
    uint32_t AD1D18IS:2;
    uint32_t AD1D18IP:3;
    uint32_t :3;
    uint32_t AD1D19IS:2;
    uint32_t AD1D19IP:3;
    uint32_t :3;
    uint32_t AD1D20IS:2;
    uint32_t AD1D20IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC19bits_t;
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs"), address(0xBF810270)));
extern volatile uint32_t        IPC19CLR __attribute__((section("sfrs"),address(0xBF810274)));
extern volatile uint32_t        IPC19SET __attribute__((section("sfrs"),address(0xBF810278)));
extern volatile uint32_t        IPC19INV __attribute__((section("sfrs"),address(0xBF81027C)));
#define IPC20 IPC20
extern volatile uint32_t   IPC20 __attribute__((section("sfrs"), address(0xBF810280)));
typedef union {
  struct {
    uint32_t AD1D21IS:2;
    uint32_t AD1D21IP:3;
    uint32_t :3;
    uint32_t AD1D22IS:2;
    uint32_t AD1D22IP:3;
    uint32_t :3;
    uint32_t AD1D23IS:2;
    uint32_t AD1D23IP:3;
    uint32_t :3;
    uint32_t AD1D24IS:2;
    uint32_t AD1D24IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC20bits_t;
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs"), address(0xBF810280)));
extern volatile uint32_t        IPC20CLR __attribute__((section("sfrs"),address(0xBF810284)));
extern volatile uint32_t        IPC20SET __attribute__((section("sfrs"),address(0xBF810288)));
extern volatile uint32_t        IPC20INV __attribute__((section("sfrs"),address(0xBF81028C)));
#define IPC21 IPC21
extern volatile uint32_t   IPC21 __attribute__((section("sfrs"), address(0xBF810290)));
typedef union {
  struct {
    uint32_t AD1D25IS:2;
    uint32_t AD1D25IP:3;
    uint32_t :3;
    uint32_t AD1D26IS:2;
    uint32_t AD1D26IP:3;
    uint32_t :3;
    uint32_t AD1D27IS:2;
    uint32_t AD1D27IP:3;
    uint32_t :3;
    uint32_t AD1D28IS:2;
    uint32_t AD1D28IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC21bits_t;
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs"), address(0xBF810290)));
extern volatile uint32_t        IPC21CLR __attribute__((section("sfrs"),address(0xBF810294)));
extern volatile uint32_t        IPC21SET __attribute__((section("sfrs"),address(0xBF810298)));
extern volatile uint32_t        IPC21INV __attribute__((section("sfrs"),address(0xBF81029C)));
#define IPC22 IPC22
extern volatile uint32_t   IPC22 __attribute__((section("sfrs"), address(0xBF8102A0)));
typedef union {
  struct {
    uint32_t AD1D29IS:2;
    uint32_t AD1D29IP:3;
    uint32_t :3;
    uint32_t AD1D30IS:2;
    uint32_t AD1D30IP:3;
    uint32_t :3;
    uint32_t AD1D31IS:2;
    uint32_t AD1D31IP:3;
    uint32_t :3;
    uint32_t AD1D32IS:2;
    uint32_t AD1D32IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs"), address(0xBF8102A0)));
extern volatile uint32_t        IPC22CLR __attribute__((section("sfrs"),address(0xBF8102A4)));
extern volatile uint32_t        IPC22SET __attribute__((section("sfrs"),address(0xBF8102A8)));
extern volatile uint32_t        IPC22INV __attribute__((section("sfrs"),address(0xBF8102AC)));
#define IPC23 IPC23
extern volatile uint32_t   IPC23 __attribute__((section("sfrs"), address(0xBF8102B0)));
typedef union {
  struct {
    uint32_t AD1D33IS:2;
    uint32_t AD1D33IP:3;
    uint32_t :3;
    uint32_t AD1D34IS:2;
    uint32_t AD1D34IP:3;
    uint32_t :3;
    uint32_t AD1D35IS:2;
    uint32_t AD1D35IP:3;
    uint32_t :3;
    uint32_t AD1D36IS:2;
    uint32_t AD1D36IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC23bits_t;
