MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM144/mcu.h
extern volatile __OFF079bits_t OFF079bits __asm__ ("OFF079") __attribute__((section("sfrs"), address(0xBF81067C)));
#define OFF080 OFF080
extern volatile uint32_t   OFF080 __attribute__((section("sfrs"), address(0xBF810680)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF080bits_t;
extern volatile __OFF080bits_t OFF080bits __asm__ ("OFF080") __attribute__((section("sfrs"), address(0xBF810680)));
#define OFF081 OFF081
extern volatile uint32_t   OFF081 __attribute__((section("sfrs"), address(0xBF810684)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF081bits_t;
extern volatile __OFF081bits_t OFF081bits __asm__ ("OFF081") __attribute__((section("sfrs"), address(0xBF810684)));
#define OFF082 OFF082
extern volatile uint32_t   OFF082 __attribute__((section("sfrs"), address(0xBF810688)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF082bits_t;
extern volatile __OFF082bits_t OFF082bits __asm__ ("OFF082") __attribute__((section("sfrs"), address(0xBF810688)));
#define OFF083 OFF083
extern volatile uint32_t   OFF083 __attribute__((section("sfrs"), address(0xBF81068C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF083bits_t;
extern volatile __OFF083bits_t OFF083bits __asm__ ("OFF083") __attribute__((section("sfrs"), address(0xBF81068C)));
#define OFF084 OFF084
extern volatile uint32_t   OFF084 __attribute__((section("sfrs"), address(0xBF810690)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF084bits_t;
extern volatile __OFF084bits_t OFF084bits __asm__ ("OFF084") __attribute__((section("sfrs"), address(0xBF810690)));
#define OFF085 OFF085
extern volatile uint32_t   OFF085 __attribute__((section("sfrs"), address(0xBF810694)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF085bits_t;
extern volatile __OFF085bits_t OFF085bits __asm__ ("OFF085") __attribute__((section("sfrs"), address(0xBF810694)));
#define OFF086 OFF086
extern volatile uint32_t   OFF086 __attribute__((section("sfrs"), address(0xBF810698)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF086bits_t;
extern volatile __OFF086bits_t OFF086bits __asm__ ("OFF086") __attribute__((section("sfrs"), address(0xBF810698)));
#define OFF087 OFF087
extern volatile uint32_t   OFF087 __attribute__((section("sfrs"), address(0xBF81069C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF087bits_t;
extern volatile __OFF087bits_t OFF087bits __asm__ ("OFF087") __attribute__((section("sfrs"), address(0xBF81069C)));
#define OFF088 OFF088
extern volatile uint32_t   OFF088 __attribute__((section("sfrs"), address(0xBF8106A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF088bits_t;
extern volatile __OFF088bits_t OFF088bits __asm__ ("OFF088") __attribute__((section("sfrs"), address(0xBF8106A0)));
#define OFF089 OFF089
extern volatile uint32_t   OFF089 __attribute__((section("sfrs"), address(0xBF8106A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF089bits_t;
extern volatile __OFF089bits_t OFF089bits __asm__ ("OFF089") __attribute__((section("sfrs"), address(0xBF8106A4)));
#define OFF090 OFF090
extern volatile uint32_t   OFF090 __attribute__((section("sfrs"), address(0xBF8106A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF090bits_t;
extern volatile __OFF090bits_t OFF090bits __asm__ ("OFF090") __attribute__((section("sfrs"), address(0xBF8106A8)));
#define OFF091 OFF091
extern volatile uint32_t   OFF091 __attribute__((section("sfrs"), address(0xBF8106AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF091bits_t;
extern volatile __OFF091bits_t OFF091bits __asm__ ("OFF091") __attribute__((section("sfrs"), address(0xBF8106AC)));
#define OFF092 OFF092
extern volatile uint32_t   OFF092 __attribute__((section("sfrs"), address(0xBF8106B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF092bits_t;
extern volatile __OFF092bits_t OFF092bits __asm__ ("OFF092") __attribute__((section("sfrs"), address(0xBF8106B0)));
#define OFF093 OFF093
extern volatile uint32_t   OFF093 __attribute__((section("sfrs"), address(0xBF8106B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF093bits_t;
extern volatile __OFF093bits_t OFF093bits __asm__ ("OFF093") __attribute__((section("sfrs"), address(0xBF8106B4)));
#define OFF094 OFF094
extern volatile uint32_t   OFF094 __attribute__((section("sfrs"), address(0xBF8106B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF094bits_t;
extern volatile __OFF094bits_t OFF094bits __asm__ ("OFF094") __attribute__((section("sfrs"), address(0xBF8106B8)));
#define OFF095 OFF095
extern volatile uint32_t   OFF095 __attribute__((section("sfrs"), address(0xBF8106BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF095bits_t;
extern volatile __OFF095bits_t OFF095bits __asm__ ("OFF095") __attribute__((section("sfrs"), address(0xBF8106BC)));
#define OFF096 OFF096
extern volatile uint32_t   OFF096 __attribute__((section("sfrs"), address(0xBF8106C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF096bits_t;
extern volatile __OFF096bits_t OFF096bits __asm__ ("OFF096") __attribute__((section("sfrs"), address(0xBF8106C0)));
#define OFF097 OFF097
extern volatile uint32_t   OFF097 __attribute__((section("sfrs"), address(0xBF8106C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF097bits_t;
extern volatile __OFF097bits_t OFF097bits __asm__ ("OFF097") __attribute__((section("sfrs"), address(0xBF8106C4)));
#define OFF098 OFF098
extern volatile uint32_t   OFF098 __attribute__((section("sfrs"), address(0xBF8106C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF098bits_t;
extern volatile __OFF098bits_t OFF098bits __asm__ ("OFF098") __attribute__((section("sfrs"), address(0xBF8106C8)));
#define OFF099 OFF099
extern volatile uint32_t   OFF099 __attribute__((section("sfrs"), address(0xBF8106CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF099bits_t;
extern volatile __OFF099bits_t OFF099bits __asm__ ("OFF099") __attribute__((section("sfrs"), address(0xBF8106CC)));
#define OFF100 OFF100
extern volatile uint32_t   OFF100 __attribute__((section("sfrs"), address(0xBF8106D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF100bits_t;
extern volatile __OFF100bits_t OFF100bits __asm__ ("OFF100") __attribute__((section("sfrs"), address(0xBF8106D0)));
#define OFF101 OFF101
extern volatile uint32_t   OFF101 __attribute__((section("sfrs"), address(0xBF8106D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF101bits_t;
extern volatile __OFF101bits_t OFF101bits __asm__ ("OFF101") __attribute__((section("sfrs"), address(0xBF8106D4)));
#define OFF102 OFF102
extern volatile uint32_t   OFF102 __attribute__((section("sfrs"), address(0xBF8106D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF102bits_t;
extern volatile __OFF102bits_t OFF102bits __asm__ ("OFF102") __attribute__((section("sfrs"), address(0xBF8106D8)));
#define OFF103 OFF103
extern volatile uint32_t   OFF103 __attribute__((section("sfrs"), address(0xBF8106DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF103bits_t;
