MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM144/mcu.h
extern volatile __SBT5ECLRSbits_t SBT5ECLRSbits __asm__ ("SBT5ECLRS") __attribute__((section("sfrs"), address(0xBF8F9430)));
#define SBT5ECLRM SBT5ECLRM
extern volatile uint32_t   SBT5ECLRM __attribute__((section("sfrs"), address(0xBF8F9438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT5ECLRMbits_t;
extern volatile __SBT5ECLRMbits_t SBT5ECLRMbits __asm__ ("SBT5ECLRM") __attribute__((section("sfrs"), address(0xBF8F9438)));
#define SBT5REG0 SBT5REG0
extern volatile uint32_t   SBT5REG0 __attribute__((section("sfrs"), address(0xBF8F9440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG0bits_t;
extern volatile __SBT5REG0bits_t SBT5REG0bits __asm__ ("SBT5REG0") __attribute__((section("sfrs"), address(0xBF8F9440)));
#define SBT5RD0 SBT5RD0
extern volatile uint32_t   SBT5RD0 __attribute__((section("sfrs"), address(0xBF8F9450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD0bits_t;
extern volatile __SBT5RD0bits_t SBT5RD0bits __asm__ ("SBT5RD0") __attribute__((section("sfrs"), address(0xBF8F9450)));
#define SBT5WR0 SBT5WR0
extern volatile uint32_t   SBT5WR0 __attribute__((section("sfrs"), address(0xBF8F9458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR0bits_t;
extern volatile __SBT5WR0bits_t SBT5WR0bits __asm__ ("SBT5WR0") __attribute__((section("sfrs"), address(0xBF8F9458)));
#define SBT5REG1 SBT5REG1
extern volatile uint32_t   SBT5REG1 __attribute__((section("sfrs"), address(0xBF8F9460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG1bits_t;
extern volatile __SBT5REG1bits_t SBT5REG1bits __asm__ ("SBT5REG1") __attribute__((section("sfrs"), address(0xBF8F9460)));
#define SBT5RD1 SBT5RD1
extern volatile uint32_t   SBT5RD1 __attribute__((section("sfrs"), address(0xBF8F9470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD1bits_t;
extern volatile __SBT5RD1bits_t SBT5RD1bits __asm__ ("SBT5RD1") __attribute__((section("sfrs"), address(0xBF8F9470)));
#define SBT5WR1 SBT5WR1
extern volatile uint32_t   SBT5WR1 __attribute__((section("sfrs"), address(0xBF8F9478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR1bits_t;
extern volatile __SBT5WR1bits_t SBT5WR1bits __asm__ ("SBT5WR1") __attribute__((section("sfrs"), address(0xBF8F9478)));
#define SBT5REG2 SBT5REG2
extern volatile uint32_t   SBT5REG2 __attribute__((section("sfrs"), address(0xBF8F9480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG2bits_t;
extern volatile __SBT5REG2bits_t SBT5REG2bits __asm__ ("SBT5REG2") __attribute__((section("sfrs"), address(0xBF8F9480)));
#define SBT5RD2 SBT5RD2
extern volatile uint32_t   SBT5RD2 __attribute__((section("sfrs"), address(0xBF8F9490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD2bits_t;
extern volatile __SBT5RD2bits_t SBT5RD2bits __asm__ ("SBT5RD2") __attribute__((section("sfrs"), address(0xBF8F9490)));
#define SBT5WR2 SBT5WR2
extern volatile uint32_t   SBT5WR2 __attribute__((section("sfrs"), address(0xBF8F9498)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR2bits_t;
extern volatile __SBT5WR2bits_t SBT5WR2bits __asm__ ("SBT5WR2") __attribute__((section("sfrs"), address(0xBF8F9498)));
#define SBT6ELOG1 SBT6ELOG1
extern volatile uint32_t   SBT6ELOG1 __attribute__((section("sfrs"), address(0xBF8F9820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT6ELOG1bits_t;
extern volatile __SBT6ELOG1bits_t SBT6ELOG1bits __asm__ ("SBT6ELOG1") __attribute__((section("sfrs"), address(0xBF8F9820)));
#define SBT6ELOG2 SBT6ELOG2
extern volatile uint32_t   SBT6ELOG2 __attribute__((section("sfrs"), address(0xBF8F9824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT6ELOG2bits_t;
extern volatile __SBT6ELOG2bits_t SBT6ELOG2bits __asm__ ("SBT6ELOG2") __attribute__((section("sfrs"), address(0xBF8F9824)));
#define SBT6ECON SBT6ECON
extern volatile uint32_t   SBT6ECON __attribute__((section("sfrs"), address(0xBF8F9828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT6ECONbits_t;
extern volatile __SBT6ECONbits_t SBT6ECONbits __asm__ ("SBT6ECON") __attribute__((section("sfrs"), address(0xBF8F9828)));
#define SBT6ECLRS SBT6ECLRS
extern volatile uint32_t   SBT6ECLRS __attribute__((section("sfrs"), address(0xBF8F9830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT6ECLRSbits_t;
extern volatile __SBT6ECLRSbits_t SBT6ECLRSbits __asm__ ("SBT6ECLRS") __attribute__((section("sfrs"), address(0xBF8F9830)));
#define SBT6ECLRM SBT6ECLRM
extern volatile uint32_t   SBT6ECLRM __attribute__((section("sfrs"), address(0xBF8F9838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT6ECLRMbits_t;
extern volatile __SBT6ECLRMbits_t SBT6ECLRMbits __asm__ ("SBT6ECLRM") __attribute__((section("sfrs"), address(0xBF8F9838)));
#define SBT6REG0 SBT6REG0
extern volatile uint32_t   SBT6REG0 __attribute__((section("sfrs"), address(0xBF8F9840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT6REG0bits_t;
extern volatile __SBT6REG0bits_t SBT6REG0bits __asm__ ("SBT6REG0") __attribute__((section("sfrs"), address(0xBF8F9840)));
#define SBT6RD0 SBT6RD0
extern volatile uint32_t   SBT6RD0 __attribute__((section("sfrs"), address(0xBF8F9850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6RD0bits_t;
extern volatile __SBT6RD0bits_t SBT6RD0bits __asm__ ("SBT6RD0") __attribute__((section("sfrs"), address(0xBF8F9850)));
#define SBT6WR0 SBT6WR0
extern volatile uint32_t   SBT6WR0 __attribute__((section("sfrs"), address(0xBF8F9858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6WR0bits_t;
extern volatile __SBT6WR0bits_t SBT6WR0bits __asm__ ("SBT6WR0") __attribute__((section("sfrs"), address(0xBF8F9858)));
#define SBT6REG1 SBT6REG1
extern volatile uint32_t   SBT6REG1 __attribute__((section("sfrs"), address(0xBF8F9860)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT6REG1bits_t;
extern volatile __SBT6REG1bits_t SBT6REG1bits __asm__ ("SBT6REG1") __attribute__((section("sfrs"), address(0xBF8F9860)));
#define SBT6RD1 SBT6RD1
extern volatile uint32_t   SBT6RD1 __attribute__((section("sfrs"), address(0xBF8F9870)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6RD1bits_t;
extern volatile __SBT6RD1bits_t SBT6RD1bits __asm__ ("SBT6RD1") __attribute__((section("sfrs"), address(0xBF8F9870)));
#define SBT6WR1 SBT6WR1
extern volatile uint32_t   SBT6WR1 __attribute__((section("sfrs"), address(0xBF8F9878)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6WR1bits_t;
extern volatile __SBT6WR1bits_t SBT6WR1bits __asm__ ("SBT6WR1") __attribute__((section("sfrs"), address(0xBF8F9878)));
#define SBT7ELOG1 SBT7ELOG1
extern volatile uint32_t   SBT7ELOG1 __attribute__((section("sfrs"), address(0xBF8F9C20)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT7ELOG1bits_t;
extern volatile __SBT7ELOG1bits_t SBT7ELOG1bits __asm__ ("SBT7ELOG1") __attribute__((section("sfrs"), address(0xBF8F9C20)));
#define SBT7ELOG2 SBT7ELOG2
extern volatile uint32_t   SBT7ELOG2 __attribute__((section("sfrs"), address(0xBF8F9C24)));
typedef struct {
  uint32_t GROUP:2;
} __SBT7ELOG2bits_t;
extern volatile __SBT7ELOG2bits_t SBT7ELOG2bits __asm__ ("SBT7ELOG2") __attribute__((section("sfrs"), address(0xBF8F9C24)));
#define SBT7ECON SBT7ECON
extern volatile uint32_t   SBT7ECON __attribute__((section("sfrs"), address(0xBF8F9C28)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT7ECONbits_t;
extern volatile __SBT7ECONbits_t SBT7ECONbits __asm__ ("SBT7ECON") __attribute__((section("sfrs"), address(0xBF8F9C28)));
#define SBT7ECLRS SBT7ECLRS
extern volatile uint32_t   SBT7ECLRS __attribute__((section("sfrs"), address(0xBF8F9C30)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT7ECLRSbits_t;
extern volatile __SBT7ECLRSbits_t SBT7ECLRSbits __asm__ ("SBT7ECLRS") __attribute__((section("sfrs"), address(0xBF8F9C30)));
#define SBT7ECLRM SBT7ECLRM
extern volatile uint32_t   SBT7ECLRM __attribute__((section("sfrs"), address(0xBF8F9C38)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT7ECLRMbits_t;
extern volatile __SBT7ECLRMbits_t SBT7ECLRMbits __asm__ ("SBT7ECLRM") __attribute__((section("sfrs"), address(0xBF8F9C38)));
#define SBT7REG0 SBT7REG0
extern volatile uint32_t   SBT7REG0 __attribute__((section("sfrs"), address(0xBF8F9C40)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT7REG0bits_t;
extern volatile __SBT7REG0bits_t SBT7REG0bits __asm__ ("SBT7REG0") __attribute__((section("sfrs"), address(0xBF8F9C40)));
#define SBT7RD0 SBT7RD0
extern volatile uint32_t   SBT7RD0 __attribute__((section("sfrs"), address(0xBF8F9C50)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7RD0bits_t;
