MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM144/mcu.h
#define _AD1DATA12_DATA_POSITION                 0x00000000
#define _AD1DATA12_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA12_DATA_LENGTH                   0x00000020

#define _AD1DATA13_DATA_POSITION                 0x00000000
#define _AD1DATA13_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA13_DATA_LENGTH                   0x00000020

#define _AD1DATA14_DATA_POSITION                 0x00000000
#define _AD1DATA14_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA14_DATA_LENGTH                   0x00000020

#define _AD1DATA15_DATA_POSITION                 0x00000000
#define _AD1DATA15_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA15_DATA_LENGTH                   0x00000020

#define _AD1DATA16_DATA_POSITION                 0x00000000
#define _AD1DATA16_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA16_DATA_LENGTH                   0x00000020

#define _AD1DATA17_DATA_POSITION                 0x00000000
#define _AD1DATA17_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA17_DATA_LENGTH                   0x00000020

#define _AD1DATA18_DATA_POSITION                 0x00000000
#define _AD1DATA18_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA18_DATA_LENGTH                   0x00000020

#define _AD1DATA19_DATA_POSITION                 0x00000000
#define _AD1DATA19_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA19_DATA_LENGTH                   0x00000020

#define _AD1DATA20_DATA_POSITION                 0x00000000
#define _AD1DATA20_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA20_DATA_LENGTH                   0x00000020

#define _AD1DATA21_DATA_POSITION                 0x00000000
#define _AD1DATA21_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA21_DATA_LENGTH                   0x00000020

#define _AD1DATA22_DATA_POSITION                 0x00000000
#define _AD1DATA22_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA22_DATA_LENGTH                   0x00000020

#define _AD1DATA23_DATA_POSITION                 0x00000000
#define _AD1DATA23_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA23_DATA_LENGTH                   0x00000020

#define _AD1DATA24_DATA_POSITION                 0x00000000
#define _AD1DATA24_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA24_DATA_LENGTH                   0x00000020

#define _AD1DATA25_DATA_POSITION                 0x00000000
#define _AD1DATA25_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA25_DATA_LENGTH                   0x00000020

#define _AD1DATA26_DATA_POSITION                 0x00000000
#define _AD1DATA26_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA26_DATA_LENGTH                   0x00000020

#define _AD1DATA27_DATA_POSITION                 0x00000000
#define _AD1DATA27_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA27_DATA_LENGTH                   0x00000020

#define _AD1DATA28_DATA_POSITION                 0x00000000
#define _AD1DATA28_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA28_DATA_LENGTH                   0x00000020

#define _AD1DATA29_DATA_POSITION                 0x00000000
#define _AD1DATA29_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA29_DATA_LENGTH                   0x00000020

#define _AD1DATA30_DATA_POSITION                 0x00000000
#define _AD1DATA30_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA30_DATA_LENGTH                   0x00000020

#define _AD1DATA31_DATA_POSITION                 0x00000000
#define _AD1DATA31_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA31_DATA_LENGTH                   0x00000020

#define _AD1DATA32_DATA_POSITION                 0x00000000
#define _AD1DATA32_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA32_DATA_LENGTH                   0x00000020

#define _AD1DATA33_DATA_POSITION                 0x00000000
#define _AD1DATA33_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA33_DATA_LENGTH                   0x00000020

#define _AD1DATA34_DATA_POSITION                 0x00000000
#define _AD1DATA34_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA34_DATA_LENGTH                   0x00000020

#define _AD1DATA35_DATA_POSITION                 0x00000000
#define _AD1DATA35_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA35_DATA_LENGTH                   0x00000020

#define _AD1DATA36_DATA_POSITION                 0x00000000
#define _AD1DATA36_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA36_DATA_LENGTH                   0x00000020

#define _AD1DATA37_DATA_POSITION                 0x00000000
#define _AD1DATA37_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA37_DATA_LENGTH                   0x00000020

#define _AD1DATA38_DATA_POSITION                 0x00000000
#define _AD1DATA38_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA38_DATA_LENGTH                   0x00000020

#define _AD1DATA39_DATA_POSITION                 0x00000000
#define _AD1DATA39_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA39_DATA_LENGTH                   0x00000020

#define _AD1DATA40_DATA_POSITION                 0x00000000
#define _AD1DATA40_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA40_DATA_LENGTH                   0x00000020

#define _AD1DATA41_DATA_POSITION                 0x00000000
#define _AD1DATA41_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA41_DATA_LENGTH                   0x00000020

#define _AD1DATA42_DATA_POSITION                 0x00000000
#define _AD1DATA42_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA42_DATA_LENGTH                   0x00000020

#define _AD1DATA43_DATA_POSITION                 0x00000000
#define _AD1DATA43_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA43_DATA_LENGTH                   0x00000020

#define _AD1DATA44_DATA_POSITION                 0x00000000
#define _AD1DATA44_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA44_DATA_LENGTH                   0x00000020

#define _AD1CAL1_ADCAL_POSITION                  0x00000000
#define _AD1CAL1_ADCAL_MASK                      0xFFFFFFFF
#define _AD1CAL1_ADCAL_LENGTH                    0x00000020

#define _AD1CAL2_ADCAL_POSITION                  0x00000000
#define _AD1CAL2_ADCAL_MASK                      0xFFFFFFFF
#define _AD1CAL2_ADCAL_LENGTH                    0x00000020

