MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM144/mcu.h
#define _CNENG_CNIEG12_POSITION                  0x0000000C
#define _CNENG_CNIEG12_MASK                      0x00001000
#define _CNENG_CNIEG12_LENGTH                    0x00000001

#define _CNENG_CNIEG13_POSITION                  0x0000000D
#define _CNENG_CNIEG13_MASK                      0x00002000
#define _CNENG_CNIEG13_LENGTH                    0x00000001

#define _CNENG_CNIEG14_POSITION                  0x0000000E
#define _CNENG_CNIEG14_MASK                      0x00004000
#define _CNENG_CNIEG14_LENGTH                    0x00000001

#define _CNENG_CNIEG15_POSITION                  0x0000000F
#define _CNENG_CNIEG15_MASK                      0x00008000
#define _CNENG_CNIEG15_LENGTH                    0x00000001

#define _CNENG_w_POSITION                        0x00000000
#define _CNENG_w_MASK                            0xFFFFFFFF
#define _CNENG_w_LENGTH                          0x00000020

#define _CNSTATG_CNSTATG0_POSITION               0x00000000
#define _CNSTATG_CNSTATG0_MASK                   0x00000001
#define _CNSTATG_CNSTATG0_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG1_POSITION               0x00000001
#define _CNSTATG_CNSTATG1_MASK                   0x00000002
#define _CNSTATG_CNSTATG1_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG6_POSITION               0x00000006
#define _CNSTATG_CNSTATG6_MASK                   0x00000040
#define _CNSTATG_CNSTATG6_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG7_POSITION               0x00000007
#define _CNSTATG_CNSTATG7_MASK                   0x00000080
#define _CNSTATG_CNSTATG7_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG8_POSITION               0x00000008
#define _CNSTATG_CNSTATG8_MASK                   0x00000100
#define _CNSTATG_CNSTATG8_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG9_POSITION               0x00000009
#define _CNSTATG_CNSTATG9_MASK                   0x00000200
#define _CNSTATG_CNSTATG9_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG12_POSITION              0x0000000C
#define _CNSTATG_CNSTATG12_MASK                  0x00001000
#define _CNSTATG_CNSTATG12_LENGTH                0x00000001

#define _CNSTATG_CNSTATG13_POSITION              0x0000000D
#define _CNSTATG_CNSTATG13_MASK                  0x00002000
#define _CNSTATG_CNSTATG13_LENGTH                0x00000001

#define _CNSTATG_CNSTATG14_POSITION              0x0000000E
#define _CNSTATG_CNSTATG14_MASK                  0x00004000
#define _CNSTATG_CNSTATG14_LENGTH                0x00000001

#define _CNSTATG_CNSTATG15_POSITION              0x0000000F
#define _CNSTATG_CNSTATG15_MASK                  0x00008000
#define _CNSTATG_CNSTATG15_LENGTH                0x00000001

#define _CNSTATG_w_POSITION                      0x00000000
#define _CNSTATG_w_MASK                          0xFFFFFFFF
#define _CNSTATG_w_LENGTH                        0x00000020

#define _ANSELH_ANSH0_POSITION                   0x00000000
#define _ANSELH_ANSH0_MASK                       0x00000001
#define _ANSELH_ANSH0_LENGTH                     0x00000001

#define _ANSELH_ANSH1_POSITION                   0x00000001
#define _ANSELH_ANSH1_MASK                       0x00000002
#define _ANSELH_ANSH1_LENGTH                     0x00000001

#define _ANSELH_ANSH4_POSITION                   0x00000004
#define _ANSELH_ANSH4_MASK                       0x00000010
#define _ANSELH_ANSH4_LENGTH                     0x00000001

#define _ANSELH_ANSH5_POSITION                   0x00000005
#define _ANSELH_ANSH5_MASK                       0x00000020
#define _ANSELH_ANSH5_LENGTH                     0x00000001

#define _ANSELH_ANSH6_POSITION                   0x00000006
#define _ANSELH_ANSH6_MASK                       0x00000040
#define _ANSELH_ANSH6_LENGTH                     0x00000001

#define _ANSELH_w_POSITION                       0x00000000
#define _ANSELH_w_MASK                           0xFFFFFFFF
#define _ANSELH_w_LENGTH                         0x00000020

#define _TRISH_TRISH0_POSITION                   0x00000000
#define _TRISH_TRISH0_MASK                       0x00000001
#define _TRISH_TRISH0_LENGTH                     0x00000001

#define _TRISH_TRISH1_POSITION                   0x00000001
#define _TRISH_TRISH1_MASK                       0x00000002
#define _TRISH_TRISH1_LENGTH                     0x00000001

#define _TRISH_TRISH2_POSITION                   0x00000002
#define _TRISH_TRISH2_MASK                       0x00000004
#define _TRISH_TRISH2_LENGTH                     0x00000001

#define _TRISH_TRISH3_POSITION                   0x00000003
#define _TRISH_TRISH3_MASK                       0x00000008
#define _TRISH_TRISH3_LENGTH                     0x00000001

#define _TRISH_TRISH4_POSITION                   0x00000004
#define _TRISH_TRISH4_MASK                       0x00000010
#define _TRISH_TRISH4_LENGTH                     0x00000001

#define _TRISH_TRISH5_POSITION                   0x00000005
#define _TRISH_TRISH5_MASK                       0x00000020
#define _TRISH_TRISH5_LENGTH                     0x00000001

#define _TRISH_TRISH6_POSITION                   0x00000006
#define _TRISH_TRISH6_MASK                       0x00000040
#define _TRISH_TRISH6_LENGTH                     0x00000001

#define _TRISH_TRISH7_POSITION                   0x00000007
#define _TRISH_TRISH7_MASK                       0x00000080
#define _TRISH_TRISH7_LENGTH                     0x00000001

#define _TRISH_TRISH8_POSITION                   0x00000008
#define _TRISH_TRISH8_MASK                       0x00000100
#define _TRISH_TRISH8_LENGTH                     0x00000001

#define _TRISH_TRISH9_POSITION                   0x00000009
#define _TRISH_TRISH9_MASK                       0x00000200
#define _TRISH_TRISH9_LENGTH                     0x00000001

#define _TRISH_TRISH10_POSITION                  0x0000000A
#define _TRISH_TRISH10_MASK                      0x00000400
#define _TRISH_TRISH10_LENGTH                    0x00000001

#define _TRISH_TRISH11_POSITION                  0x0000000B
#define _TRISH_TRISH11_MASK                      0x00000800
#define _TRISH_TRISH11_LENGTH                    0x00000001

